Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс/ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс</name>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоОрганизациям</registerRecords>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоРегионам</registerRecords>
  <attributes>
    <name>schemeVersion</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>externalId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>purchaseNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>docNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>href</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>printForm</name>
    <comment>url - Ссылка для скачивания документа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>extPrintForm</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>purchaseObjectInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>purchaseResponsible</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>isBudgetUnionState</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>isGOZ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>isBBST</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>placingWay</name>
    <type>
      <types>CatalogRef.ГЗ_placingWay_ПодспособОпределенияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>article15FeaturesInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>article15Attachments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>contractConclusionOnSt83Ch2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>okpd2okved2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ETP</name>
    <type>
      <types>CatalogRef.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка</types>
    </type>
  </attributes>
  <attributes>
    <name>totalSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>totalSumCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_startDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_place</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_order</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_endDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_addInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>scoring_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>bidding_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>bidding_addinfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>customerRequirements</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>modification</name>
    <comment>заполняется в случае внесения изменений в документы извещения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>purchaseObjects</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>isMedicalProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>OKEI</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>purchaseObject_Строкой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>customerQuantities</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>customer</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс/ManagerModule.bsl
// Создает документ по переданной структуре
//
// Параметры:
//  - ДанныеЗаполнения - Структура - структура свойств документа
//
// Возвращаемое значение:
//  - Ссылка - ссылка на созданный элемент справочника
//
Функция СоздатьДокументИзвещениеОК_Д_ДвухэтапныйКонкурс(ДанныеЗаполнения) Экспорт
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		НайденныйДокумент = Документы.ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс.НайтиПоРеквизиту("purchaseNumber",ДанныеЗаполнения.purchaseNumber) ;
		
		Если НайденныйДокумент.Пустая() Тогда 
			ДокументГЗ = Документы.ГЗ_ИзвещениеОПроведенииЗакупокОК_Д_ДвухЭтапныйКонкурс.СоздатьДокумент();
		Иначе 	
			ДокументГЗ = НайденныйДокумент.ПолучитьОбъект();
			ДокументГЗ.purchaseObjects.Очистить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументГЗ,ДанныеЗаполнения);
		ДокументГЗ.purchaseObjects.Загрузить(ДанныеЗаполнения.purchaseObjects);
		Попытка
			ДокументГЗ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументГЗ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("ГЗ.ЗагрузкаДанныхИзXML", УровеньЖурналаРегистрации.Ошибка,,,"Пустая структура для заполнения документа");
	КонецЕсли;	
	//Возврат ДокументСсылка;
КонецФункции

Функция ВернутьСтруктуруТабличнойЧастиДокумента() Экспорт 
	ТабличнаяЧастьИзвещения = Новый	 ТаблицаЗначений;
	ТабличнаяЧастьИзвещения.Колонки.Добавить("purchaseObject", ,"purchaseObject");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("purchaseObject_Строкой", ,"purchaseObject_Строкой");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("price", ,"price");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("quantity", ,"quantity");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("sum", ,"sum");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("isMedicalProduct", ,"isMedicalProduct");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("OKEI", ,"OKEI");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("name", ,"name");
	Возврат  ТабличнаяЧастьИзвещения;
КонецФункции
